print("{} 평균 : {:.2f}".format("홍길동",(100+100+99)/3))
name = "홍길동"

### f함수 소수점자리 출력
a = 1.12345
print(f"소수점 2자리 출력 : {a:.2f}")



print("출력이 됩니다.!!")
# \ : 공백을 제거할때
print("""\
    1. 2024년 9월17일 레바논 무장 정치세력 헤즈볼라 대원들이 사용하는
    삐삐(무선호출기) 수천 대가 동시다발적으로 폭발했다.
    9월18일엔 헤즈볼라 대원들이 사용하는 워키토키(휴대용 무선 송수신기)
    수백 대가 역시 동시다발적으로 폭발했다. 
      """)





# name = "홍길동"
# num = 100
# num2 = 100
# num3 = 99
# print("%s 합계 : %d" % (name,num+num2+num3))
# print("{} 합계 : {}".format(name,num+num2+num3))  # 포맷

# print("%s 평균 : %.2f" % (name,(num+num2+num3)/3))
# print("{} 평균 :{:.2f}".format(name,(num+num2+num3)/3))  #{:.2f} - 소수점 2자리

# # 숫자 : 12.12345 , 456.78940, 2.252525
# # 소수점 2자리 출력
# # 숫자 : 12.12 , 456.79, 2.25
# print("{:.2f},{:.2f},{:.2f}".format(12.12345,456.78940,2.252525))

# print("\*")  # \문자 : 문자를 넣고싶을때
# print("안녕\n하세요.")  # \n : 줄단락 바꿈
# print("안녕\t하세요.")  # \t : tab 효과
# print("안녕\b 하세요.") # \b : 뒤로 한칸을 지움

# print("2024년 9월17일 레바논 무장 정치세력 헤즈볼라 대원들이 사용하는 삐삐(무선호출기) 수천 대가 동시다발적으로 폭발했다.\n9월18일엔 헤즈볼라 대원들이 사용하는 워키토키(휴대용 무선 송수신기) 수백 대가 역시 동시다발적으로 폭발했다.")

# # \ : 공백을 제거할때
# print("""\
#     1. 2024년 9월17일 레바논 무장 정치세력 헤즈볼라 대원들이 사용하는
#     삐삐(무선호출기) 수천 대가 동시다발적으로 폭발했다.
#     9월18일엔 헤즈볼라 대원들이 사용하는 워키토키(휴대용 무선 송수신기)
#     수백 대가 역시 동시다발적으로 폭발했다. 
#       """)